GopalSaraf/Practicals/PSDL/include/proc/pic16f914.inc
// Register: LCDDATA2
#define LCDDATA2 LCDDATA2
LCDDATA2                                 equ 0112h
// bitfield definitions
LCDDATA2_SEG16_POSN                      equ 0000h
LCDDATA2_SEG16_POSITION                  equ 0000h
LCDDATA2_SEG16_SIZE                      equ 0001h
LCDDATA2_SEG16_LENGTH                    equ 0001h
LCDDATA2_SEG16_MASK                      equ 0001h
LCDDATA2_SEG17_POSN                      equ 0001h
LCDDATA2_SEG17_POSITION                  equ 0001h
LCDDATA2_SEG17_SIZE                      equ 0001h
LCDDATA2_SEG17_LENGTH                    equ 0001h
LCDDATA2_SEG17_MASK                      equ 0002h
LCDDATA2_SEG18_POSN                      equ 0002h
LCDDATA2_SEG18_POSITION                  equ 0002h
LCDDATA2_SEG18_SIZE                      equ 0001h
LCDDATA2_SEG18_LENGTH                    equ 0001h
LCDDATA2_SEG18_MASK                      equ 0004h
LCDDATA2_SEG19_POSN                      equ 0003h
LCDDATA2_SEG19_POSITION                  equ 0003h
LCDDATA2_SEG19_SIZE                      equ 0001h
LCDDATA2_SEG19_LENGTH                    equ 0001h
LCDDATA2_SEG19_MASK                      equ 0008h
LCDDATA2_SEG20_POSN                      equ 0004h
LCDDATA2_SEG20_POSITION                  equ 0004h
LCDDATA2_SEG20_SIZE                      equ 0001h
LCDDATA2_SEG20_LENGTH                    equ 0001h
LCDDATA2_SEG20_MASK                      equ 0010h
LCDDATA2_SEG21_POSN                      equ 0005h
LCDDATA2_SEG21_POSITION                  equ 0005h
LCDDATA2_SEG21_SIZE                      equ 0001h
LCDDATA2_SEG21_LENGTH                    equ 0001h
LCDDATA2_SEG21_MASK                      equ 0020h
LCDDATA2_SEG22_POSN                      equ 0006h
LCDDATA2_SEG22_POSITION                  equ 0006h
LCDDATA2_SEG22_SIZE                      equ 0001h
LCDDATA2_SEG22_LENGTH                    equ 0001h
LCDDATA2_SEG22_MASK                      equ 0040h
LCDDATA2_SEG23_POSN                      equ 0007h
LCDDATA2_SEG23_POSITION                  equ 0007h
LCDDATA2_SEG23_SIZE                      equ 0001h
LCDDATA2_SEG23_LENGTH                    equ 0001h
LCDDATA2_SEG23_MASK                      equ 0080h
LCDDATA2_SEG16COM0_POSN                  equ 0000h
LCDDATA2_SEG16COM0_POSITION              equ 0000h
LCDDATA2_SEG16COM0_SIZE                  equ 0001h
LCDDATA2_SEG16COM0_LENGTH                equ 0001h
LCDDATA2_SEG16COM0_MASK                  equ 0001h
LCDDATA2_SEG17COM0_POSN                  equ 0001h
LCDDATA2_SEG17COM0_POSITION              equ 0001h
LCDDATA2_SEG17COM0_SIZE                  equ 0001h
LCDDATA2_SEG17COM0_LENGTH                equ 0001h
LCDDATA2_SEG17COM0_MASK                  equ 0002h
LCDDATA2_SEG18COM0_POSN                  equ 0002h
LCDDATA2_SEG18COM0_POSITION              equ 0002h
LCDDATA2_SEG18COM0_SIZE                  equ 0001h
LCDDATA2_SEG18COM0_LENGTH                equ 0001h
LCDDATA2_SEG18COM0_MASK                  equ 0004h
LCDDATA2_SEG19COM0_POSN                  equ 0003h
LCDDATA2_SEG19COM0_POSITION              equ 0003h
LCDDATA2_SEG19COM0_SIZE                  equ 0001h
LCDDATA2_SEG19COM0_LENGTH                equ 0001h
LCDDATA2_SEG19COM0_MASK                  equ 0008h
LCDDATA2_SEG20COM0_POSN                  equ 0004h
LCDDATA2_SEG20COM0_POSITION              equ 0004h
LCDDATA2_SEG20COM0_SIZE                  equ 0001h
LCDDATA2_SEG20COM0_LENGTH                equ 0001h
LCDDATA2_SEG20COM0_MASK                  equ 0010h
LCDDATA2_SEG21COM0_POSN                  equ 0005h
LCDDATA2_SEG21COM0_POSITION              equ 0005h
LCDDATA2_SEG21COM0_SIZE                  equ 0001h
LCDDATA2_SEG21COM0_LENGTH                equ 0001h
LCDDATA2_SEG21COM0_MASK                  equ 0020h
LCDDATA2_SEG22COM0_POSN                  equ 0006h
LCDDATA2_SEG22COM0_POSITION              equ 0006h
LCDDATA2_SEG22COM0_SIZE                  equ 0001h
LCDDATA2_SEG22COM0_LENGTH                equ 0001h
LCDDATA2_SEG22COM0_MASK                  equ 0040h
LCDDATA2_SEG23COM0_POSN                  equ 0007h
LCDDATA2_SEG23COM0_POSITION              equ 0007h
LCDDATA2_SEG23COM0_SIZE                  equ 0001h
LCDDATA2_SEG23COM0_LENGTH                equ 0001h
LCDDATA2_SEG23COM0_MASK                  equ 0080h
LCDDATA2_S16C0_POSN                      equ 0000h
LCDDATA2_S16C0_POSITION                  equ 0000h
LCDDATA2_S16C0_SIZE                      equ 0001h
LCDDATA2_S16C0_LENGTH                    equ 0001h
LCDDATA2_S16C0_MASK                      equ 0001h
LCDDATA2_S17C0_POSN                      equ 0001h
LCDDATA2_S17C0_POSITION                  equ 0001h
LCDDATA2_S17C0_SIZE                      equ 0001h
LCDDATA2_S17C0_LENGTH                    equ 0001h
LCDDATA2_S17C0_MASK                      equ 0002h
LCDDATA2_S18C0_POSN                      equ 0002h
LCDDATA2_S18C0_POSITION                  equ 0002h
LCDDATA2_S18C0_SIZE                      equ 0001h
LCDDATA2_S18C0_LENGTH                    equ 0001h
LCDDATA2_S18C0_MASK                      equ 0004h
LCDDATA2_S19C0_POSN                      equ 0003h
LCDDATA2_S19C0_POSITION                  equ 0003h
LCDDATA2_S19C0_SIZE                      equ 0001h
LCDDATA2_S19C0_LENGTH                    equ 0001h
LCDDATA2_S19C0_MASK                      equ 0008h
LCDDATA2_S20C0_POSN                      equ 0004h
LCDDATA2_S20C0_POSITION                  equ 0004h
LCDDATA2_S20C0_SIZE                      equ 0001h
LCDDATA2_S20C0_LENGTH                    equ 0001h
LCDDATA2_S20C0_MASK                      equ 0010h
LCDDATA2_S21C0_POSN                      equ 0005h
LCDDATA2_S21C0_POSITION                  equ 0005h
LCDDATA2_S21C0_SIZE                      equ 0001h
LCDDATA2_S21C0_LENGTH                    equ 0001h
LCDDATA2_S21C0_MASK                      equ 0020h
LCDDATA2_S22C0_POSN                      equ 0006h
LCDDATA2_S22C0_POSITION                  equ 0006h
LCDDATA2_S22C0_SIZE                      equ 0001h
LCDDATA2_S22C0_LENGTH                    equ 0001h
LCDDATA2_S22C0_MASK                      equ 0040h
LCDDATA2_S23C0_POSN                      equ 0007h
LCDDATA2_S23C0_POSITION                  equ 0007h
LCDDATA2_S23C0_SIZE                      equ 0001h
LCDDATA2_S23C0_LENGTH                    equ 0001h
LCDDATA2_S23C0_MASK                      equ 0080h

// Register: LCDDATA3
#define LCDDATA3 LCDDATA3
LCDDATA3                                 equ 0113h
// bitfield definitions
LCDDATA3_SEG0_POSN                       equ 0000h
LCDDATA3_SEG0_POSITION                   equ 0000h
LCDDATA3_SEG0_SIZE                       equ 0001h
LCDDATA3_SEG0_LENGTH                     equ 0001h
LCDDATA3_SEG0_MASK                       equ 0001h
LCDDATA3_SEG1_POSN                       equ 0001h
LCDDATA3_SEG1_POSITION                   equ 0001h
LCDDATA3_SEG1_SIZE                       equ 0001h
LCDDATA3_SEG1_LENGTH                     equ 0001h
LCDDATA3_SEG1_MASK                       equ 0002h
LCDDATA3_SEG2_POSN                       equ 0002h
LCDDATA3_SEG2_POSITION                   equ 0002h
LCDDATA3_SEG2_SIZE                       equ 0001h
LCDDATA3_SEG2_LENGTH                     equ 0001h
LCDDATA3_SEG2_MASK                       equ 0004h
LCDDATA3_SEG3_POSN                       equ 0003h
LCDDATA3_SEG3_POSITION                   equ 0003h
LCDDATA3_SEG3_SIZE                       equ 0001h
LCDDATA3_SEG3_LENGTH                     equ 0001h
LCDDATA3_SEG3_MASK                       equ 0008h
LCDDATA3_SEG4_POSN                       equ 0004h
LCDDATA3_SEG4_POSITION                   equ 0004h
LCDDATA3_SEG4_SIZE                       equ 0001h
LCDDATA3_SEG4_LENGTH                     equ 0001h
LCDDATA3_SEG4_MASK                       equ 0010h
LCDDATA3_SEG5_POSN                       equ 0005h
LCDDATA3_SEG5_POSITION                   equ 0005h
LCDDATA3_SEG5_SIZE                       equ 0001h
LCDDATA3_SEG5_LENGTH                     equ 0001h
LCDDATA3_SEG5_MASK                       equ 0020h
LCDDATA3_SEG6_POSN                       equ 0006h
LCDDATA3_SEG6_POSITION                   equ 0006h
LCDDATA3_SEG6_SIZE                       equ 0001h
LCDDATA3_SEG6_LENGTH                     equ 0001h
LCDDATA3_SEG6_MASK                       equ 0040h
LCDDATA3_SEG7_POSN                       equ 0007h
LCDDATA3_SEG7_POSITION                   equ 0007h
LCDDATA3_SEG7_SIZE                       equ 0001h
LCDDATA3_SEG7_LENGTH                     equ 0001h
LCDDATA3_SEG7_MASK                       equ 0080h
LCDDATA3_SEG0COM1_POSN                   equ 0000h
LCDDATA3_SEG0COM1_POSITION               equ 0000h
LCDDATA3_SEG0COM1_SIZE                   equ 0001h
LCDDATA3_SEG0COM1_LENGTH                 equ 0001h
LCDDATA3_SEG0COM1_MASK                   equ 0001h
LCDDATA3_SEG1COM1_POSN                   equ 0001h
LCDDATA3_SEG1COM1_POSITION               equ 0001h
LCDDATA3_SEG1COM1_SIZE                   equ 0001h
LCDDATA3_SEG1COM1_LENGTH                 equ 0001h
LCDDATA3_SEG1COM1_MASK                   equ 0002h
LCDDATA3_SEG2COM1_POSN                   equ 0002h
LCDDATA3_SEG2COM1_POSITION               equ 0002h
LCDDATA3_SEG2COM1_SIZE                   equ 0001h
LCDDATA3_SEG2COM1_LENGTH                 equ 0001h
LCDDATA3_SEG2COM1_MASK                   equ 0004h
LCDDATA3_SEG3COM1_POSN                   equ 0003h
LCDDATA3_SEG3COM1_POSITION               equ 0003h
LCDDATA3_SEG3COM1_SIZE                   equ 0001h
LCDDATA3_SEG3COM1_LENGTH                 equ 0001h
LCDDATA3_SEG3COM1_MASK                   equ 0008h
LCDDATA3_SEG4COM1_POSN                   equ 0004h
LCDDATA3_SEG4COM1_POSITION               equ 0004h
LCDDATA3_SEG4COM1_SIZE                   equ 0001h
LCDDATA3_SEG4COM1_LENGTH                 equ 0001h
LCDDATA3_SEG4COM1_MASK                   equ 0010h
LCDDATA3_SEG5COM1_POSN                   equ 0005h
LCDDATA3_SEG5COM1_POSITION               equ 0005h
LCDDATA3_SEG5COM1_SIZE                   equ 0001h
LCDDATA3_SEG5COM1_LENGTH                 equ 0001h
LCDDATA3_SEG5COM1_MASK                   equ 0020h
LCDDATA3_SEG6COM1_POSN                   equ 0006h
LCDDATA3_SEG6COM1_POSITION               equ 0006h
LCDDATA3_SEG6COM1_SIZE                   equ 0001h
LCDDATA3_SEG6COM1_LENGTH                 equ 0001h
LCDDATA3_SEG6COM1_MASK                   equ 0040h
LCDDATA3_SEG7COM1_POSN                   equ 0007h
LCDDATA3_SEG7COM1_POSITION               equ 0007h
LCDDATA3_SEG7COM1_SIZE                   equ 0001h
LCDDATA3_SEG7COM1_LENGTH                 equ 0001h
LCDDATA3_SEG7COM1_MASK                   equ 0080h
LCDDATA3_S0C1_POSN                       equ 0000h
LCDDATA3_S0C1_POSITION                   equ 0000h
LCDDATA3_S0C1_SIZE                       equ 0001h
LCDDATA3_S0C1_LENGTH                     equ 0001h
LCDDATA3_S0C1_MASK                       equ 0001h
LCDDATA3_S1C1_POSN                       equ 0001h
LCDDATA3_S1C1_POSITION                   equ 0001h
LCDDATA3_S1C1_SIZE                       equ 0001h
LCDDATA3_S1C1_LENGTH                     equ 0001h
LCDDATA3_S1C1_MASK                       equ 0002h
LCDDATA3_S2C1_POSN                       equ 0002h
LCDDATA3_S2C1_POSITION                   equ 0002h
LCDDATA3_S2C1_SIZE                       equ 0001h
LCDDATA3_S2C1_LENGTH                     equ 0001h
LCDDATA3_S2C1_MASK                       equ 0004h
LCDDATA3_S3C1_POSN                       equ 0003h
LCDDATA3_S3C1_POSITION                   equ 0003h
LCDDATA3_S3C1_SIZE                       equ 0001h
LCDDATA3_S3C1_LENGTH                     equ 0001h
LCDDATA3_S3C1_MASK                       equ 0008h
LCDDATA3_S4C1_POSN                       equ 0004h
LCDDATA3_S4C1_POSITION                   equ 0004h
LCDDATA3_S4C1_SIZE                       equ 0001h
LCDDATA3_S4C1_LENGTH                     equ 0001h
LCDDATA3_S4C1_MASK                       equ 0010h
LCDDATA3_S5C1_POSN                       equ 0005h
LCDDATA3_S5C1_POSITION                   equ 0005h
LCDDATA3_S5C1_SIZE                       equ 0001h
LCDDATA3_S5C1_LENGTH                     equ 0001h
LCDDATA3_S5C1_MASK                       equ 0020h
LCDDATA3_S6C1_POSN                       equ 0006h
LCDDATA3_S6C1_POSITION                   equ 0006h
LCDDATA3_S6C1_SIZE                       equ 0001h
LCDDATA3_S6C1_LENGTH                     equ 0001h
LCDDATA3_S6C1_MASK                       equ 0040h
LCDDATA3_S7C1_POSN                       equ 0007h
LCDDATA3_S7C1_POSITION                   equ 0007h
LCDDATA3_S7C1_SIZE                       equ 0001h
LCDDATA3_S7C1_LENGTH                     equ 0001h
LCDDATA3_S7C1_MASK                       equ 0080h

