GopalSaraf/Practicals/PSDL/include/proc/pic16f914.inc
// Register: LCDDATA4
#define LCDDATA4 LCDDATA4
LCDDATA4                                 equ 0114h
// bitfield definitions
LCDDATA4_SEG8_POSN                       equ 0000h
LCDDATA4_SEG8_POSITION                   equ 0000h
LCDDATA4_SEG8_SIZE                       equ 0001h
LCDDATA4_SEG8_LENGTH                     equ 0001h
LCDDATA4_SEG8_MASK                       equ 0001h
LCDDATA4_SEG9_POSN                       equ 0001h
LCDDATA4_SEG9_POSITION                   equ 0001h
LCDDATA4_SEG9_SIZE                       equ 0001h
LCDDATA4_SEG9_LENGTH                     equ 0001h
LCDDATA4_SEG9_MASK                       equ 0002h
LCDDATA4_SEG10_POSN                      equ 0002h
LCDDATA4_SEG10_POSITION                  equ 0002h
LCDDATA4_SEG10_SIZE                      equ 0001h
LCDDATA4_SEG10_LENGTH                    equ 0001h
LCDDATA4_SEG10_MASK                      equ 0004h
LCDDATA4_SEG11_POSN                      equ 0003h
LCDDATA4_SEG11_POSITION                  equ 0003h
LCDDATA4_SEG11_SIZE                      equ 0001h
LCDDATA4_SEG11_LENGTH                    equ 0001h
LCDDATA4_SEG11_MASK                      equ 0008h
LCDDATA4_SEG12_POSN                      equ 0004h
LCDDATA4_SEG12_POSITION                  equ 0004h
LCDDATA4_SEG12_SIZE                      equ 0001h
LCDDATA4_SEG12_LENGTH                    equ 0001h
LCDDATA4_SEG12_MASK                      equ 0010h
LCDDATA4_SEG13_POSN                      equ 0005h
LCDDATA4_SEG13_POSITION                  equ 0005h
LCDDATA4_SEG13_SIZE                      equ 0001h
LCDDATA4_SEG13_LENGTH                    equ 0001h
LCDDATA4_SEG13_MASK                      equ 0020h
LCDDATA4_SEG14_POSN                      equ 0006h
LCDDATA4_SEG14_POSITION                  equ 0006h
LCDDATA4_SEG14_SIZE                      equ 0001h
LCDDATA4_SEG14_LENGTH                    equ 0001h
LCDDATA4_SEG14_MASK                      equ 0040h
LCDDATA4_SEG15_POSN                      equ 0007h
LCDDATA4_SEG15_POSITION                  equ 0007h
LCDDATA4_SEG15_SIZE                      equ 0001h
LCDDATA4_SEG15_LENGTH                    equ 0001h
LCDDATA4_SEG15_MASK                      equ 0080h
LCDDATA4_SEG8COM1_POSN                   equ 0000h
LCDDATA4_SEG8COM1_POSITION               equ 0000h
LCDDATA4_SEG8COM1_SIZE                   equ 0001h
LCDDATA4_SEG8COM1_LENGTH                 equ 0001h
LCDDATA4_SEG8COM1_MASK                   equ 0001h
LCDDATA4_SEG9COM1_POSN                   equ 0001h
LCDDATA4_SEG9COM1_POSITION               equ 0001h
LCDDATA4_SEG9COM1_SIZE                   equ 0001h
LCDDATA4_SEG9COM1_LENGTH                 equ 0001h
LCDDATA4_SEG9COM1_MASK                   equ 0002h
LCDDATA4_SEG10COM1_POSN                  equ 0002h
LCDDATA4_SEG10COM1_POSITION              equ 0002h
LCDDATA4_SEG10COM1_SIZE                  equ 0001h
LCDDATA4_SEG10COM1_LENGTH                equ 0001h
LCDDATA4_SEG10COM1_MASK                  equ 0004h
LCDDATA4_SEG11COM1_POSN                  equ 0003h
LCDDATA4_SEG11COM1_POSITION              equ 0003h
LCDDATA4_SEG11COM1_SIZE                  equ 0001h
LCDDATA4_SEG11COM1_LENGTH                equ 0001h
LCDDATA4_SEG11COM1_MASK                  equ 0008h
LCDDATA4_SEG12COM1_POSN                  equ 0004h
LCDDATA4_SEG12COM1_POSITION              equ 0004h
LCDDATA4_SEG12COM1_SIZE                  equ 0001h
LCDDATA4_SEG12COM1_LENGTH                equ 0001h
LCDDATA4_SEG12COM1_MASK                  equ 0010h
LCDDATA4_SEG13COM1_POSN                  equ 0005h
LCDDATA4_SEG13COM1_POSITION              equ 0005h
LCDDATA4_SEG13COM1_SIZE                  equ 0001h
LCDDATA4_SEG13COM1_LENGTH                equ 0001h
LCDDATA4_SEG13COM1_MASK                  equ 0020h
LCDDATA4_SEG14COM1_POSN                  equ 0006h
LCDDATA4_SEG14COM1_POSITION              equ 0006h
LCDDATA4_SEG14COM1_SIZE                  equ 0001h
LCDDATA4_SEG14COM1_LENGTH                equ 0001h
LCDDATA4_SEG14COM1_MASK                  equ 0040h
LCDDATA4_SEG15COM1_POSN                  equ 0007h
LCDDATA4_SEG15COM1_POSITION              equ 0007h
LCDDATA4_SEG15COM1_SIZE                  equ 0001h
LCDDATA4_SEG15COM1_LENGTH                equ 0001h
LCDDATA4_SEG15COM1_MASK                  equ 0080h
LCDDATA4_S8C1_POSN                       equ 0000h
LCDDATA4_S8C1_POSITION                   equ 0000h
LCDDATA4_S8C1_SIZE                       equ 0001h
LCDDATA4_S8C1_LENGTH                     equ 0001h
LCDDATA4_S8C1_MASK                       equ 0001h
LCDDATA4_S9C1_POSN                       equ 0001h
LCDDATA4_S9C1_POSITION                   equ 0001h
LCDDATA4_S9C1_SIZE                       equ 0001h
LCDDATA4_S9C1_LENGTH                     equ 0001h
LCDDATA4_S9C1_MASK                       equ 0002h
LCDDATA4_S10C1_POSN                      equ 0002h
LCDDATA4_S10C1_POSITION                  equ 0002h
LCDDATA4_S10C1_SIZE                      equ 0001h
LCDDATA4_S10C1_LENGTH                    equ 0001h
LCDDATA4_S10C1_MASK                      equ 0004h
LCDDATA4_S11C1_POSN                      equ 0003h
LCDDATA4_S11C1_POSITION                  equ 0003h
LCDDATA4_S11C1_SIZE                      equ 0001h
LCDDATA4_S11C1_LENGTH                    equ 0001h
LCDDATA4_S11C1_MASK                      equ 0008h
LCDDATA4_S12C1_POSN                      equ 0004h
LCDDATA4_S12C1_POSITION                  equ 0004h
LCDDATA4_S12C1_SIZE                      equ 0001h
LCDDATA4_S12C1_LENGTH                    equ 0001h
LCDDATA4_S12C1_MASK                      equ 0010h
LCDDATA4_S13C1_POSN                      equ 0005h
LCDDATA4_S13C1_POSITION                  equ 0005h
LCDDATA4_S13C1_SIZE                      equ 0001h
LCDDATA4_S13C1_LENGTH                    equ 0001h
LCDDATA4_S13C1_MASK                      equ 0020h
LCDDATA4_S14C1_POSN                      equ 0006h
LCDDATA4_S14C1_POSITION                  equ 0006h
LCDDATA4_S14C1_SIZE                      equ 0001h
LCDDATA4_S14C1_LENGTH                    equ 0001h
LCDDATA4_S14C1_MASK                      equ 0040h
LCDDATA4_S15C1_POSN                      equ 0007h
LCDDATA4_S15C1_POSITION                  equ 0007h
LCDDATA4_S15C1_SIZE                      equ 0001h
LCDDATA4_S15C1_LENGTH                    equ 0001h
LCDDATA4_S15C1_MASK                      equ 0080h

// Register: LCDDATA5
#define LCDDATA5 LCDDATA5
LCDDATA5                                 equ 0115h
// bitfield definitions
LCDDATA5_SEG16_POSN                      equ 0000h
LCDDATA5_SEG16_POSITION                  equ 0000h
LCDDATA5_SEG16_SIZE                      equ 0001h
LCDDATA5_SEG16_LENGTH                    equ 0001h
LCDDATA5_SEG16_MASK                      equ 0001h
LCDDATA5_SEG17_POSN                      equ 0001h
LCDDATA5_SEG17_POSITION                  equ 0001h
LCDDATA5_SEG17_SIZE                      equ 0001h
LCDDATA5_SEG17_LENGTH                    equ 0001h
LCDDATA5_SEG17_MASK                      equ 0002h
LCDDATA5_SEG18_POSN                      equ 0002h
LCDDATA5_SEG18_POSITION                  equ 0002h
LCDDATA5_SEG18_SIZE                      equ 0001h
LCDDATA5_SEG18_LENGTH                    equ 0001h
LCDDATA5_SEG18_MASK                      equ 0004h
LCDDATA5_SEG19_POSN                      equ 0003h
LCDDATA5_SEG19_POSITION                  equ 0003h
LCDDATA5_SEG19_SIZE                      equ 0001h
LCDDATA5_SEG19_LENGTH                    equ 0001h
LCDDATA5_SEG19_MASK                      equ 0008h
LCDDATA5_SEG20_POSN                      equ 0004h
LCDDATA5_SEG20_POSITION                  equ 0004h
LCDDATA5_SEG20_SIZE                      equ 0001h
LCDDATA5_SEG20_LENGTH                    equ 0001h
LCDDATA5_SEG20_MASK                      equ 0010h
LCDDATA5_SEG21_POSN                      equ 0005h
LCDDATA5_SEG21_POSITION                  equ 0005h
LCDDATA5_SEG21_SIZE                      equ 0001h
LCDDATA5_SEG21_LENGTH                    equ 0001h
LCDDATA5_SEG21_MASK                      equ 0020h
LCDDATA5_SEG22_POSN                      equ 0006h
LCDDATA5_SEG22_POSITION                  equ 0006h
LCDDATA5_SEG22_SIZE                      equ 0001h
LCDDATA5_SEG22_LENGTH                    equ 0001h
LCDDATA5_SEG22_MASK                      equ 0040h
LCDDATA5_SEG23_POSN                      equ 0007h
LCDDATA5_SEG23_POSITION                  equ 0007h
LCDDATA5_SEG23_SIZE                      equ 0001h
LCDDATA5_SEG23_LENGTH                    equ 0001h
LCDDATA5_SEG23_MASK                      equ 0080h
LCDDATA5_SEG16COM1_POSN                  equ 0000h
LCDDATA5_SEG16COM1_POSITION              equ 0000h
LCDDATA5_SEG16COM1_SIZE                  equ 0001h
LCDDATA5_SEG16COM1_LENGTH                equ 0001h
LCDDATA5_SEG16COM1_MASK                  equ 0001h
LCDDATA5_SEG17COM1_POSN                  equ 0001h
LCDDATA5_SEG17COM1_POSITION              equ 0001h
LCDDATA5_SEG17COM1_SIZE                  equ 0001h
LCDDATA5_SEG17COM1_LENGTH                equ 0001h
LCDDATA5_SEG17COM1_MASK                  equ 0002h
LCDDATA5_SEG18COM1_POSN                  equ 0002h
LCDDATA5_SEG18COM1_POSITION              equ 0002h
LCDDATA5_SEG18COM1_SIZE                  equ 0001h
LCDDATA5_SEG18COM1_LENGTH                equ 0001h
LCDDATA5_SEG18COM1_MASK                  equ 0004h
LCDDATA5_SEG19COM1_POSN                  equ 0003h
LCDDATA5_SEG19COM1_POSITION              equ 0003h
LCDDATA5_SEG19COM1_SIZE                  equ 0001h
LCDDATA5_SEG19COM1_LENGTH                equ 0001h
LCDDATA5_SEG19COM1_MASK                  equ 0008h
LCDDATA5_SEG20COM1_POSN                  equ 0004h
LCDDATA5_SEG20COM1_POSITION              equ 0004h
LCDDATA5_SEG20COM1_SIZE                  equ 0001h
LCDDATA5_SEG20COM1_LENGTH                equ 0001h
LCDDATA5_SEG20COM1_MASK                  equ 0010h
LCDDATA5_SEG21COM1_POSN                  equ 0005h
LCDDATA5_SEG21COM1_POSITION              equ 0005h
LCDDATA5_SEG21COM1_SIZE                  equ 0001h
LCDDATA5_SEG21COM1_LENGTH                equ 0001h
LCDDATA5_SEG21COM1_MASK                  equ 0020h
LCDDATA5_SEG22COM1_POSN                  equ 0006h
LCDDATA5_SEG22COM1_POSITION              equ 0006h
LCDDATA5_SEG22COM1_SIZE                  equ 0001h
LCDDATA5_SEG22COM1_LENGTH                equ 0001h
LCDDATA5_SEG22COM1_MASK                  equ 0040h
LCDDATA5_SEG23COM1_POSN                  equ 0007h
LCDDATA5_SEG23COM1_POSITION              equ 0007h
LCDDATA5_SEG23COM1_SIZE                  equ 0001h
LCDDATA5_SEG23COM1_LENGTH                equ 0001h
LCDDATA5_SEG23COM1_MASK                  equ 0080h
LCDDATA5_S16C1_POSN                      equ 0000h
LCDDATA5_S16C1_POSITION                  equ 0000h
LCDDATA5_S16C1_SIZE                      equ 0001h
LCDDATA5_S16C1_LENGTH                    equ 0001h
LCDDATA5_S16C1_MASK                      equ 0001h
LCDDATA5_S17C1_POSN                      equ 0001h
LCDDATA5_S17C1_POSITION                  equ 0001h
LCDDATA5_S17C1_SIZE                      equ 0001h
LCDDATA5_S17C1_LENGTH                    equ 0001h
LCDDATA5_S17C1_MASK                      equ 0002h
LCDDATA5_S18C1_POSN                      equ 0002h
LCDDATA5_S18C1_POSITION                  equ 0002h
LCDDATA5_S18C1_SIZE                      equ 0001h
LCDDATA5_S18C1_LENGTH                    equ 0001h
LCDDATA5_S18C1_MASK                      equ 0004h
LCDDATA5_S19C1_POSN                      equ 0003h
LCDDATA5_S19C1_POSITION                  equ 0003h
LCDDATA5_S19C1_SIZE                      equ 0001h
LCDDATA5_S19C1_LENGTH                    equ 0001h
LCDDATA5_S19C1_MASK                      equ 0008h
LCDDATA5_S20C1_POSN                      equ 0004h
LCDDATA5_S20C1_POSITION                  equ 0004h
LCDDATA5_S20C1_SIZE                      equ 0001h
LCDDATA5_S20C1_LENGTH                    equ 0001h
LCDDATA5_S20C1_MASK                      equ 0010h
LCDDATA5_S21C1_POSN                      equ 0005h
LCDDATA5_S21C1_POSITION                  equ 0005h
LCDDATA5_S21C1_SIZE                      equ 0001h
LCDDATA5_S21C1_LENGTH                    equ 0001h
LCDDATA5_S21C1_MASK                      equ 0020h
LCDDATA5_S22C1_POSN                      equ 0006h
LCDDATA5_S22C1_POSITION                  equ 0006h
LCDDATA5_S22C1_SIZE                      equ 0001h
LCDDATA5_S22C1_LENGTH                    equ 0001h
LCDDATA5_S22C1_MASK                      equ 0040h
LCDDATA5_S23C1_POSN                      equ 0007h
LCDDATA5_S23C1_POSITION                  equ 0007h
LCDDATA5_S23C1_SIZE                      equ 0001h
LCDDATA5_S23C1_LENGTH                    equ 0001h
LCDDATA5_S23C1_MASK                      equ 0080h

